fitranurmayadi/esp32-microlm/kibo_espidf/sdkconfig.defaults
# ESP32-S3 CPU & Clock Frequency
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Coprocessor CP0 Support (Xtensa PIE 128-bit SIMD Vector Unit)
CONFIG_ESP32S3_COPROC_SUPPORT=y

# Compiler Performance Optimization (-O3)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# 8MB Octal OPI PSRAM Configuration
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE=8388608
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Flash Configuration (16MB DIO)
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
